In [1]:
%load_ext sql
%sql sqlite:///dataset_university.db

'Connected: @dataset_university.db'

In [20]:
%%sql drop table if exists student;
create table student(
    StdSSN varchar primary key, 
    StdFirstName varchar NOT NULL,               
    StdLastName varchar NOT NULL,
    StdClass varchar NOT NULL,
    StdMajor varchar NOT NULL,
    StdGPA float NOT NULL
);

insert into student values('std001', 'Kang', 'Park', 'SR', 'IS', 4.2);
insert into student values('std002', 'Duck', 'Lee', 'JR', 'IS', 4.0);
insert into student values('std003', 'Jung', 'Lim', 'JR', 'IS', 4.0);
insert into student values('std004', 'Han', 'Kim','SR', 'OR', 4.3);
insert into student values('std005', 'Dae', 'Kim','SR', 'OR', 4.0);
insert into student values('fac001', 'Min', 'Song','SR', 'IS', 4.0);

drop table if exists faculty;
create table faculty(
    FacSSN varchar primary key, 
    FacFirstName varchar NOT NULL,               
    FacLastName varchar NOT NULL,
    FacSalary int NOT NULL,
    FacRank varchar NOT NULL,
    FacDept varchar NOT NULL,
    FacSupervisor varchar,
    FacEmail TEXT NOT NULL UNIQUE,
    FacHireDate date NOT NULL,
    
    FOREIGN KEY (FacSupervisor) 
      REFERENCES faculty (FacSSN)
);
insert into faculty(FacSSN, FacFirstName, FacLastName, FacSalary, FacRank, FacDept, FacEmail, FacHireDate) values('fac001', 'Min', 'Song', 100, 'AS_PROF', 'IME', 'mssong@postech.ac.kr', date('2016-03-01'));
insert into faculty values('fac002', 'Dong', 'Choi', 150, 'AS_PROF','IME', 'fac001', 'dgchoi@postech.ac.kr', date('2016-03-01'));
insert into faculty(FacSSN, FacFirstName, FacLastName, FacSalary, FacRank, FacDept, FacEmail, FacHireDate) values('fac004', 'Myung', 'Ko', 250, 'PROF','IME', 'youngko@postech.ac.kr', date('2012-03-01'));
insert into faculty values('fac003', 'Min', 'Che', 200, 'PROF','IME', 'fac004', 'mchae@postech.ac.kr', date('2019-05-01'));

 * sqlite:///dataset_university.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [16]:
%%sql 
drop table if exists course;
create table course(
    CourseNo varchar NOT NULL, 
    CrsDesc varchar NOT NULL,               
    CrsUnits varchar NOT NULL  
);
insert into course values('imen001', 'Database', '3');
insert into course values('imen002', 'MIS', '3');
insert into course values('imen003', 'Statistics', '3');
insert into course values('cs001', 'Programming', '3');

drop table if exists offering;
create table offering(
    OfferNo varchar primary key,
    OffTerm varchar NOT NULL,
    OffYear int NOT NULL,
    OffDays varcar NOT NULL,
    CourseNo varchar NOT NULL,
    FacSSN varchar,
    
    FOREIGN KEY (CourseNo) 
      REFERENCES course (CourseNo),
    FOREIGN KEY (FacSSN) 
      REFERENCES faculty (FacSSN)
    
);


insert into offering values('offer01', 'FALL', 2020, 'Tue/Thur', 'imen001', 'fac001');
insert into offering values('offer02', 'SPRING', 2019, 'Tue/Thur', 'imen003', 'fac002');
insert into offering (OfferNo, OffTerm, OffYear, OffDays, CourseNo) values('offer03', 'FALL', 2020, 'Tue/Thur', 'imen002');
insert into offering values('offer04', 'FALL', 2020, 'Mon/Wed', 'imen002', 'fac001');
insert into offering values('offer05', 'FALL', 2020, 'Tue/Thur', 'imen003', 'fac004');
insert into offering values('offer06', 'FALL', 2020, 'Tue/Thur', 'imen003', 'fac003');

drop table if exists enrollment;
create table enrollment(
    OfferNo varchar NOT NULL, 
    StdSSN varchar NOT NULL,               
    EnrGrade varchar NOT NULL,
    
    PRIMARY KEY (OfferNo, StdSSN),
    FOREIGN KEY (OfferNo) 
      REFERENCES offer (OfferNo), 
    FOREIGN KEY (StdSSN) 
      REFERENCES student (StdSSN)    
);


insert into enrollment values('offer01', 'std001', 'A+');
insert into enrollment values('offer01', 'std002', 'A0');
insert into enrollment values('offer01', 'std003', 'A0');
insert into enrollment values('offer02', 'std004', 'A+');
insert into enrollment values('offer02', 'std005', 'A0');
insert into enrollment values('offer03', 'std001', 'A0');
insert into enrollment values('offer03', 'std002', 'A0');
insert into enrollment values('offer03', 'std003', 'A0');
insert into enrollment values('offer03', 'std004', 'A+');
insert into enrollment values('offer03', 'std005', 'A0');
insert into enrollment values('offer04', 'std001', 'A0');
insert into enrollment values('offer04', 'std002', 'A0');
insert into enrollment values('offer04', 'std003', 'A0');
insert into enrollment values('offer04', 'std004', 'A+');
insert into enrollment values('offer04', 'std005', 'A0');
insert into enrollment values('offer05', 'std001', 'A0');
insert into enrollment values('offer05', 'std002', 'A0');
insert into enrollment values('offer05', 'std003', 'A0');
insert into enrollment values('offer06', 'std002', 'A0');
insert into enrollment values('offer06', 'std003', 'A0');
insert into enrollment values('offer06', 'std004', 'A+');
insert into enrollment values('offer06', 'std005', 'A0');

 * sqlite:///dataset_university.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]